import React, { useState } from 'react';
import { useParams } from 'react-router-dom'; // Import useParams

const FilmDetails = () => {
  const movies = [
      {
        id: 1,
        title: "Годзіла та Конг: Нова імперія",
        genre: "Пригодницький бойовик",
        country: "США",
        year: 2024,
        rating: 8.2,
        imdbLink: "https://www.imdb.com/title/tt5034838/",
        imageSrc: "https://i.ibb.co/WWkVKJ4/image-2024-04-02-124254.png",
        imageAlt: "Годзіла та Конг: Нова імперія",
        className: "godzila slick-picture",
        actors: ["Олександр Скаргард, ", "Міллі Боббі Браун, ", "Кейлі Хоттл, ", "Ребекка Холл"],
        description: (
          <span>
            Світ здригнувся від несподіваного відкриття. Виявляється, у недрах землі завжди існувала величезна нестримна сила, здатна знищити все, що трапиться на шляху. Давні вороги Ґодзілла та Конґ не готові до примирення, однак перед лицем загрози, яка може знищити їх та увесь світ, вони змушені будуть об’єднатися. Жодні зусилля людей не здатні вплинути на могутню силу, що прокинулася.
            <br /><br />
            Фантастичний бойовик «Ґодзілла та Конґ: Нова імперія» є прямим продовженням фільму «Ґодзілла проти Конґа», що вийшов у 2021 році та п’ятим внеском у франшизу MonsterVerse, яку створює студія Legendary Pictures. Ще до релізу попередньої частини творці фільму говорили про те, що мають багато планів щодо розвитку сюжету, а подальша доля франшизи залежатиме від касового успіху. Таким чином популярність попереднього фільму обумовила появу нового. У березні 2022 року оголосили про початок робіт. Зйомки проходили у Австралії, зокрема у місті Голд-Кост на Тихоокеанському узбережжі.
          </span>
        ),
        age: "12+",
        duration: "2 години 11 хвилин",
        language: "Українська",
        session: ["10-00", "12-00", "15-00", "18-00"]
      },
      {
        id: 2,
        title: "Дюна: Частина друга",
        genre: "Наукова фантастика, Пригоди",
        country: "США",
        year: 2024,
        rating: 8.7,
        imdbLink: "https://www.imdb.com/title/tt3778605/",
        imageSrc: "https://i.ibb.co/cXd0hHF/image-2024-04-02-124610.png",
        imageAlt: "Дюна: Частина друга",
        className: "duna slick-picture",
        actors: ["Тімоті Шаламе, ", "Ребекка Фергюсон, ", "Оскар Айзек, ", "Зендея Коулмен, ", "Хав'єр Бардем"],
        description: (
          <span>
            Події розгортаються на пустельній планеті Арракіс, де видобувається найцінніша у світі речовина «прянощі». Нащадок Дому Атрідів Пол (Тімоті Шаламе) приєднується до фременів, які діють під проводом Стілгара (Хав'єр Бардем). Разом із ним його матір Джессіка (Ребекка Ферґюсон). Вони вирушають на зустріч страшному та невідворотному майбутньому – війні, що охопить усі відомі куточки імперії.
            <br /><br />
            Фантастичний бойовик «Дюна. Частина друга» є продовженням фільму, що вийшов на екрани у 2021 році. У основу сюжету покладено однойменний роман Френка Герберта. За мотивами книги створено низку відеоігор та настільних ігор. Книга вийшла друком 1965 року і відтоді її неодноразово намагалися екранізувати. Тривалий час це нікому не вдавалося. 1984 року з’явилася версія режисера Девіда Лінча, проте вона не мала успіху. Дені Вільньов став режисером першого фільму та продовжив роботу над другою частиною. Робота над нею розпочалася у серпні 2021 року.
          </span>
        ),
        age: "12+",
        duration: "2 години 35 хвилин",
        language: "Українська",
        session: ["10-00", "12-00", "15-00", "18-00"]
      },
      {
        id: 3,
        title: "Лишайся онлайн",
        genre: "Бойовик, Драма, Трилер",
        country: "США",
        year: 2024,
        rating: 7.5,
        imdbLink: "https://www.imdb.com/title/tt1097010/",
        imageSrc: "https://i.ibb.co/DzGKWB7/image-2024-04-02-124350.png",
        imageAlt: "Лишайся онлайн",
        className: "be-online slick-picture",
        actors: ["Райан Рейнольдс, ", "Вейк Роуен, ", "Адрієн Перрі, ", "Блайк Лайвли"],
        description: (
          <span>
            У перші дні повномасштабного вторгнення Каті (Єлизавета Зайцева) випадково потрапляє до рук чужий ноутбук. Спроби знайти власника дають несподіваний результат. Оскільки дівчина не вийшла з облікових записів власника, вона має змогу спілкуватися від його імені. Катя приймає відеодзвінок від 8-річного Сави (Гордій Дзюбинський). Хлопчик впевнений, що телефонує тату і не знає де поділися його батьки. Катя вирішує допомогти дитині. В умовах боїв, які ведуться у Бучі, а саме звідти родина хлопчика, з’ясувати де ж вони знаходяться не так легко, як хотілося б. Катя просить про допомогу своїх знайомих, які воюють.
            <br /><br />
            Драма та трилер «Лишайся онлайн» знята у форматі скрінлайф. Частина зйомок велася у Швеції та Львові, у реальних місцях для прихистку біженців. Українці, які поїхали від війни, знялися у кількох масових сценах. На роль хлопчика розглядалося 80 дітей. Єлизавету Зайцеву, яка виконала головну роль, обрали з поміж 30 претенденток. На момент зйомок вона була вагітна.
          </span>
        ),
        age: "16+",
        duration: "1 година 42 хвилини",
        language: "Українська",
        session: ["10-00", "12-00", "15-00", "18-00"]
      },
      {
        id: 4,
    title: "Небезпечна гра",
    genre: "Трилер, Кримінал",
    country: "США",
    year: 2024,
    rating: 6.8,
    imdbLink: "https://www.imdb.com/title/tt1006774/",
    imageSrc: "https://i.ibb.co/jWYLn2W/image-2024-04-02-124449.png",
    imageAlt: "Небезпечна гра",
    className: "dangerous-game slick-picture",
    actors: ["Ліам Хемсворт", "Рассел Кроу", "Майлз Теллер"],
    description: (
      <span>
        Колись Вінсент (Гійом Кане) врятував життя Матьє (Іван Атталь). Відтоді вони підтримують близькі стосунки. Разом з дружинами багато подорожують та ведуть спільний бізнес. Головна відмінність між чоловіками в тому, що Вінсент є рішучим в усьому, а Матьє прагне уникнути будь-якої відповідальності. Він ніколи не зраджував свою дружину, на відміну від Вінсента, який часто змінює коханок. Чергова його дівчина Ельза (Альма Ходоровскі) справила на Матьє неймовірне враження і він закохався. Низка випадкових подій призводить до непоправних наслідків. Що б не відбувалося, навряд чи це змусить Матьє бути рішучішим.
        <br /><br />
        Трилер та драма «Небезпечна гра» створено у копродукції Франції, Ісландії та Бельгії. Найбільше для появи фільму потрудився Іван Атталь. Разом з Яель Лангманн він адаптував сценарій. Спершу це була комедійна п’єса, написана Еріком Асусом. Сюжет доопрацювали і перетворили у напружену драму про стосунки. Іван Атталь сам зайняв режисерське крісло та виконав одну з провідних ролей.
      </span>
    ),
    age: "18+",
    duration: "1 година 59 хвилин",
    language: "Українська",
    session: ["10-00", "12-00", "15-00", "18-00"]
  },
  {
    id: 5,
    title: "Кілер іде геть",
    genre: "Комедія, Бойовик",
    country: "США",
    year: 2024,
    rating: 7.2,
    imdbLink: "https://www.imdb.com/title/tt1099943/",
    imageSrc: "https://i.ibb.co/54BNcGm/image-2024-04-02-124520.png",
    imageAlt: "Кілер іде геть",
    className: "killer slick-picture",
    actors: ["Арнольд Шварценеггер, ", "Міла Юрковіч, ", "Морена Бакар"],
    description: (
      <span>
        Непомітний одинак Джон Нокс (Майкл Кітон) з двома докторськими ступенями майже не з ким не спілкується. Такий стиль життя – чудове прикриття для висококласного кілера. Черговий похід до лікаря закінчився для нього невтішними новинами: в нього рідкісна форма прогресуючої деменції. Аби закінчити усі свої справи в чоловіка залишились лічені тижні. Через хворобу він майже провалив останнє своє завдання, тож треба поспішити та зробити все як слід. Раптом на порозі його дому з’являється скривавлений Майлз (Джеймс Марсден) – син, з яким він давно не спілкувався. Тепер, окрім своїх проблем, Джон має залагодити ще й проблеми сина.
        <br /><br />
        Трилер «Кілер іде геть» – другий фільм, режисований 72-річним Майклом Кітоном. Окрім того, він став співпродюсером картини та виконав головну роль. Сценарій написав Ґрегорі Пуар'є («Плітки», «Король лев 2: Гордість Сімби»). Зйомки фільму проходили наприкінці 2022 року у Лос-Анджелесі.
      </span>
    ),
    age: "16+",
    duration: "1 година 42 хвилини",
    language: "Українська",
    session: ["10-00", "12-00", "15-00", "18-00"]
  },
  {
    id: 6,
    title: "Панда Кунг-Фу 4",
    genre: "Анімація, Пригоди, Комедія",
    country: "США, Китай",
    year: 2024,
    rating: 7.6,
    imdbLink: "https://www.imdb.com/title/tt4571044/",
    imageSrc: "https://i.ibb.co/KVfvfR6/panda.webp",
    imageAlt: "Панда Кунг-Фу 4",
    className: "panda slick-picture",
    actors: ["Український дубляж: ", "Василь Байдак, ", "Леся Самаєва, ", "Іван та Дмитро Решетнік"],
    description: (
      <span>
        Тільки на перший погляд По – неповороткий товстун. Насправді ж він видатний майстер бойових мистецтв та Воїн Дракона. Так було донедавна, однак По вирішив відмовитися від почесного звання та зайнятися духовними настановами. Це неабияк засмутило багатьох, особливо майстра Шифу. Аби виправити ситуацію, По береться шукати того, хто стане новим Воїном Дракона.
        <br /><br />
        Пригодницький бойовик «Панда Кунг-фу 4» є четвертим внеском у франшизу та прямим продовженням однойменного фільму, що вийшов у 2018 році. Про те, що ця історія може розростися до шести фільмів вперше заговорили ще у 2010 році. Вихід четвертої частини анонсували у 2022 році. Тоді ж творці наголосили, що сюжетна лінія зосередиться на особистості головного героя, всесвіт розшириться і з’являться нові персонажі. Відомо, що проект стане одним з двох останніх, знятий повністю на потужностях студії DreamWorks Animation. Нові свої роботи вони створюватимуть, залучаючи до співпраці інші студії.
      </span>
    ),
    age: "6+",
    duration: "1 година 35 хвилин",
    language: "Українська",
    session: ["10-00", "12-00", "15-00", "18-00"]
  },
    {
      id: 7,
      title: 'Омен: Початок',
      genre: 'Жахи, Містика, Трилер',
      country: 'США',
      year: 2024,
      rating: 6.5,
      imdbLink: 'https://www.imdb.com/title/tt1125019/',
      imageSrc: 'https://i.ibb.co/c8yzytP/omen.webp',
      imageAlt: 'Омен: Початок',
      className: 'omen slick-picture',
      actors: ["Міа Гот, ", "Дем'єн Плекінз, ", "Джеффрі Доннел, "],
      description: (
        <span>
          Події розгортаються у Римі незадовго до того, як у родині американського дипломата Роберта Торна та його дружини Кеті стається трагедія. Під час пологів помре їхній син-первісток. Цього ще не сталося. Молода американка (Нелл Тайгер Фрі) прибуває до Риму аби присвятити своє життя служінню церкві. Водночас вона спробує викрити злочинну змову, яка має призвести до появи на світ Антихриста.
          <br /><br />
          Фільм жахів «Омен: Початок» є шостим внеском у однойменну франшизу та приквелом найпершого фільму, що вийшов на екрани у 1976 році. Стрічку режисувала Аркаша Стівенсон за сценарієм, написаним нею разом із Тімом Смітом та Кейтом Томасом. У основу сюжету лягло оповідання Бена Джейкобі. Про задум зняти приквел до відомої франшизи вперше заговорили у 2016 році. Тоді йшлося про написання сценарію Беном Джейкобі. У 2022 році на режисерську посаду була затверджена дебютантка Стівенсон. Основні зйомки завершились у січні 2023 року.
        </span>
      ),
      age: "18+",
      duration: "1 година 40 хвилин",
      language: "Українська",
      session: ["10-00", "12-00", "15-00", "18-00"]
    },
    {
    id: 8,
    title: "Материнський інстинкт",
    genre: "Трилер, Драма",
    country: "Велика Британія",
    year: 2024,
    rating: 8.1,
    imdbLink: "https://www.imdb.com/title/tt7919196/",
    imageSrc: "https://i.ibb.co/qCddcSH/mother-instinct.webp",
    imageAlt: "Материнський інстинкт",
    className: "mother-instinct slick-picture",
    actors: ["Моріц Бляйбтрой, ", "Джессіка Честейн, ", "Інгеборг Дапкунайте"],
    description: (
      <span>
        Події відбуваються у США у 1960-х роках. Давні подруги Еліс (Джессіка Честейн) та Селін (Енн Гетевей) живуть по сусідству. Вони насолоджуються розміреним життям та виховують синів одного віку. Через нещасний випадок син Селін помирає. Подіє глибоко травмує усіх. Еліс була свідком загибелі хлопчика і з часом розуміє, що Селін винить її у тому, що вона не змогла його врятувати. Химерне хитросплетіння горя, підозр та звинувачень отруює життя двох родин.
        <br /><br />
        Трилер та драма «Материнський інстинкт» є перезйомкою французького фільму, що вийшов на екрани у 2018 році. Він, у свою чергу, є екранізацією роману Барбари Абель 2012 року. Спершу передбачалося, що режисувати фільм буде Оливье Массе-Депасс, який був автором сценарієм та режисером французького фільму. Через особисті обставини він вибув з проекту і його місце зайняв Бенуа Деломма. Він досвідчений оператор, за плечима якого зйомки майже 40 стрічок («Хлопчик у смугастій піжамі», «Теорія всього»).
      </span>
    ),
    age: "16+",
    duration: "1 година 48 хвилин",
    language: "Українська",
    session: ["10-00", "12-00", "15-00", "18-00"]
    },
  ];

  const { id } = useParams(); // Get film ID from route parameters

  const selectedFilm = movies.find((movie) => movie.id === parseInt(id)); // Find film by ID

  const [showSessions, setShowSessions] = useState(false); // State for session popup visibility

  const toggleSessions = () => {
    setShowSessions(!showSessions); // Toggle session popup visibility
  };

  return (
    <div className="film-details">
      <div className="film-details__poster">
        <img src={selectedFilm.imageSrc} alt={selectedFilm.imageAlt} className={selectedFilm.className} />
      </div>
      <div className="film-details__info">
        <h2 className="film-details__title">{selectedFilm.title}</h2>
        <div className="film-details__meta">
          <span className="film-details__genre"><b>Жанр:</b> {selectedFilm.genre}</span>
          <span className="film-details__year"> ({selectedFilm.year})</span>
        </div>
        <div className="film-details__actors"><b>Актори: </b>{selectedFilm.actors}</div>
        <div className="film-details__description">
          <p><b>Опис та сюжет: </b>{selectedFilm.description}</p>
        </div>
        <div className="film-details__additional">
          <div className="film-details__age"><b>Вікова категорія: </b>{selectedFilm.age}</div>
          <div className="film-details__duration"><b>Тривалість: </b>{selectedFilm.duration}</div>
          <div className="film-details__language"><b>Мова: </b>{selectedFilm.language}</div>
          <button className="film-details__button" onClick={toggleSessions}>Сеанси</button>
        </div>
      </div>

      {showSessions && (
        <div className="film-details__sessions">
          <h3>Виберіть сеанс:</h3>
          <ul>
            {selectedFilm.session.map((sessionTime) => (
              <li key={sessionTime}>
                <button className="film-details__session-button">{sessionTime}</button>
              </li>
            ))}
          </ul>
        </div>
      )}
    </div>
  );
};

export default FilmDetails;